/* Head_01 : 기본머리
 * Head_02 : 기본머리+머리띠
 * Head_03 : 두건
 * Head_04 : 기본투구
 * Head_05 : 기본투구+코덮개
 * Head_06 : 기본투구+뒤통수보호대
 * Head_07, Head_08, Head_09: 기사투구 
 * Head_11 : 마법사모자
*/

/* Head_01a : 기본머리
 * Head_01b : 기본머리+짧은수염+턱수염
 * Head_01c : 대머리+짧은수염
 * Head_01d : 대머리+짧은수염+턱수염
 * Head_01e : 흰머리+짧은수염+턱수염
 * Head_02b : 기본머리+머리띠
 * Head_02d : 기본머리+짧은수염+턱수염+머리띠
 * Head_02f : 흰머리+짧은수염+턱수염+머리띠
 * Head_03b : 두건
 * Head_03c : 두건+흰머리+짧은수염+턱수염
 * Head_04a : 기본투구
 * Head_04b : 기본투구+턱수염
 * Head_04e : 기본투구+철덧댐+흰머리+턱수염
 * Head_05b : 기본투구+코덮개
 * Head_05c : 기본투구+턱수염
 * Head_06a : 기본투구+뒤통수보호대
 * Head_06c : 기본투구+뒤통수보호대+투구끈
 * Head_06d : 기본투구+뒤통수보호대+투구끈많은거
 * Head_06f : 기본투구+뒤통수보호대+투구끈많은거+흰수염
 * Head_06g : 기본투구+뒤통수보호대+투구뾰족장식+턱수염
 * Head_06h : 기본투구+뒤통수보호대+투구뾰족장식+바이킹+턱수염
 * Head_07a : 기사투구 앞가리개 올리것
 * Head_07b : 기사투구 앞가리개 올리것+턱수염+투구끈
 * Head_07c : T자(얼굴노출) 기사투구
 * Head_07d : T자(얼굴노출) 바이킹투구
 * Head_07e : T자(얼굴노출) 바이킹투구+머리끈
 * Head_08a : 기사투구 앞가리개(눈)
 * Head_08b : 기사투구 앞가리개(눈)+머리끈
 * Head_08c : 기사투구 (숨구멍있는거)
 * Head_08d : 기사투구+코덮개
 * Head_08e : 기사투구+코덮개+투구끈+뿔장식(바이킹X)
 * Head_08f : 원통형 기사투구
 * Head_08g : 원통형 기사투구+투구끈많은거
 * Head_09a : 원통형 T자 기사투구
 * Head_09b : 원통형 T자 기사투구+투구끈많은거
 * Head_09c : 원통형 T자 기사투구+바이킹
 * Head_09d : T자 기사투구+투구끈많은거
 * Head_09e : T자 기사투구+투구장식
 * Head_09f : T자 기사투구+바이킹
 * Head_09g : 기사투구 앞가리개(안면,눈안보임)
 * Head_09h : 기사투구 앞가리개(안면,눈안보임)+투구끈많은거
 * Head_11a : 마법사모자+턱수염
 * Head_11b : 마법사모자+긴턱수염
 * Head_11d : 마법사모자+긴턱수염+흰수염
 */
