#include <stdio.h>


int main(void)
{
	int a = 10;
	//변수 선언
	/*
	변수 : 데이터를 저장할 수 있는 메모리 공간
	상수 : 변하지 않는 값
	
	변수 선언 : 저장될 값의 데이터형에 따라 필요한만큼 메모리를 할당받고 이름을 붙인다.
	변수를 선언하는 방법
	자료형 + 변수명;

	변수 초기화 : 선언된 변수를 사용하려면 반드시 값을 넣어주는 작업이 필요한데, 이 작업을 초기화(Initialization)이라고 한다.
	변수를 초기화 하는방법
	1 : 자료형 + 변수명 = 값; int a = 0; (선언과 동시에 초기화)
	2 : 자료형 + 변수명; 변수명 = 값; int a;  a=0; (선언 후 초기화)

	변수를 선언할 때 주의점
	1. 변수의 이름을 지을때 어떤 기능을 할지 신경을 써서 이름을 지어야 한다
	2. 변수의 이름은 숫자로 시작할 수 없다.
	3. 변수의 이름에 띄어쓰기를 사용할 수 없다.
	4. 변수의 이름에 특수문자 !@#$등을 사용할 수 없다.(_는 특수문자로 적용시키지 않는다)



	전역변수와 지역변수
	차이 : 사용할수 있는 허용범위
	전역범수 : 어디서나 사용할수 있는범위
	지역변수 : 선언된 위치에서만 사용 가능 ({ } 안에서 선언, 중괄호 밖에서는 사용이 불가능하다)

	int number1; : 전역변수

	int main(void)
	{
		int number2; : 지역변수


		return 0;
	}





	연산자 정리하기


	*/
	
	
	


	printf_s("Hello World!!");

	return 0;
}
